{"id":"acs-breast-cancer-symptoms-main-2025","source":"American Cancer Society","title":"Breast Cancer Signs and Symptoms","url":"https://www.cancer.org/cancer/types/breast-cancer/screening-tests-and-early-detection/breast-cancer-signs-and-symptoms.html","text":"The most common symptom of breast cancer is a new lump or mass. A painless, hard mass with irregular edges is more likely to be cancer, but breast cancers can also be soft, round, tender, or even painful. Other symptoms include swelling of all or part of a breast, skin dimpling that may resemble an orange peel, breast or nipple pain, nipple retraction, red or flaking skin, nipple discharge not related to breastfeeding, and swollen lymph nodes under the arm or near the collarbone. These symptoms can also be caused by benign breast conditions. Hormonal changes during menstruation, pregnancy, or menopause may affect breast texture. Birth control or hormone therapy can make breasts denser, which makes it harder to detect cancer on a mammogram. If you notice any new lump or change, it's important to get it checked by a healthcare professional. Regular screening, like mammograms, can help detect breast cancer early, even before symptoms appear, and improve chances of successful treatment.","last_verified":"2025-10-31"}
{"id":"acs-breast-cancer-symptoms-expanded-2025","source":"American Cancer Society","title":"Breast Cancer Signs and Symptoms","url":"https://www.cancer.org/cancer/types/breast-cancer/screening-tests-and-early-detection/breast-cancer-signs-and-symptoms.html","text":"Knowing how your breasts normally look and feel is important for breast health. While mammograms are vital for screening, they don’t detect every breast cancer. The most common symptom is a new lump or mass. A painless, hard mass with irregular edges is more likely to be cancer, but breast cancers can also be soft, round, tender, or painful. Other symptoms include swelling of all or part of a breast, skin dimpling (like an orange peel), breast or nipple pain, nipple retraction, red or flaking skin, nipple discharge not related to breastfeeding, and swollen lymph nodes under the arm or near the collarbone. These symptoms can also result from benign conditions. Hormonal changes, pregnancy, and menopause can affect breast texture. Birth control or hormone therapy may increase breast density, making mammograms harder to interpret. If you notice any new lump or change, it’s important to have it checked by a healthcare professional. Regular screening, including mammograms, can help detect breast cancer early, even before symptoms appear, improving chances of successful treatment.","last_verified":"2025-10-31"}
{"id":"acs-breast-cancer-treatment-overview-2025","source":"American Cancer Society","title":"Breast Cancer Treatment Options","url":"https://www.cancer.org/cancer/types/breast-cancer/treatment.html","text":"Breast cancer treatment depends on the type and stage of the cancer, as well as a person’s overall health, menopause status, and preferences. Local treatments like surgery and radiation target the tumor directly. Most patients undergo surgery to remove the tumor, sometimes followed or preceded by radiation. Systemic treatments use drugs that travel through the body to reach cancer cells. These include chemotherapy, hormone therapy, targeted therapy, and immunotherapy. Treatment plans are tailored based on cancer type and progression. Patients may be treated by a team including breast surgeons, radiation oncologists, medical oncologists, and plastic surgeons. Supportive care services such as nutrition, counseling, and financial aid are also available. Clinical trials may offer access to new treatments. Patients are encouraged to discuss all options, ask questions, and consider second opinions to make informed decisions.","last_verified":"2025-10-31"}
{"id":"acs-breast-cancer-screening-guidelines-2025","source":"American Cancer Society","title":"ACS Breast Cancer Screening Guidelines","url":"https://www.cancer.org/cancer/types/breast-cancer/screening-tests-and-early-detection/american-cancer-society-recommendations-for-the-early-detection-of-breast-cancer.html","text":"Finding breast cancer early and getting state-of-the-art treatment are key to reducing deaths. Screening means checking for cancer before symptoms appear. The American Cancer Society recommends that women at average risk begin yearly mammograms at age 45, with the option to start at 40. At age 55, women may switch to mammograms every other year or continue annually. Screening should continue as long as a woman is in good health and expected to live at least 10 more years. Women at high risk—such as those with BRCA mutations, strong family history, or prior chest radiation—should begin annual mammograms and breast MRIs starting at age 30. Clinical breast exams and self-exams are not recommended for average-risk women due to limited evidence of benefit. Women should be familiar with how their breasts normally look and feel and report any changes to a healthcare provider. The ACS supports access to both 2D and 3D mammograms and believes cost should not be a barrier to screening.","last_verified":"2025-10-31"}
{"id":"nccn-invasive-breast-cancer-guide-2025","source":"National Comprehensive Cancer Network","title":"NCCN Guidelines for Patients: Invasive Breast Cancer","url":"https://www.nccn.org/patientresources/patient-resources/guidelines-for-patients","text":"Invasive breast cancer is cancer that has spread from the milk ducts or lobules into surrounding breast tissue or nearby lymph nodes. It is also called early-stage breast cancer. The NCCN Guidelines for Patients explain expert recommendations in plain language to help patients understand their diagnosis and treatment options. The breast is made of ducts, lobules, fat, nerves, blood and lymph vessels, and connective tissue. Cancer can spread through lymph or blood to other parts of the body. Testing includes medical history, physical exams, imaging, biopsies, and lab tests. Important factors include hormone receptor status, HER2 status, and genetic risk. Treatment planning may involve surgery, radiation, chemotherapy, hormone therapy, or targeted therapy. Patients are encouraged to advocate for themselves, ask questions, and participate in shared decision-making. The guide also covers fertility concerns, distress screening, and supportive care. Imaging tests include mammograms, MRIs, PET scans, and ultrasounds. Biopsies help confirm diagnosis and guide treatment decisions.","last_verified":"2025-10-31"}
{"id":"nccn-breast-cancer-risk-reduction-2026","source":"National Comprehensive Cancer Network","title":"NCCN Guidelines: Breast Cancer Risk Reduction","url":"https://www.nccn.org/guidelines/category_2","text":"The NCCN Guidelines for Breast Cancer Risk Reduction provide evidence-based recommendations for assessing and managing breast cancer risk. They outline familial and non-familial risk factors, including genetic variants, personal history of atypical hyperplasia or LCIS, and lifestyle influences. The guidelines discourage routine use of polygenic risk scores due to limited validation. Risk-reducing options include endocrine therapy (e.g., tamoxifen, raloxifene), lifestyle changes, and in select cases, risk-reducing mastectomy. Counseling should address diet, hormone therapy risks, and individualized decision-making. The guidelines emphasize shared decision-making, periodic reassessment of risk, and consideration of life expectancy when recommending interventions. Surveillance strategies are provided for those who decline risk-reducing therapy.","last_verified":"2025-10-31"}
{"id":"mayo-breast-cancer-symptoms-causes-2025","source":"Mayo Clinic","title":"Breast Cancer Symptoms and Causes","url":"https://www.mayoclinic.org/diseases-conditions/breast-cancer/symptoms-causes/syc-20352470","text":"Breast cancer is a disease where cells in the breast grow uncontrollably. It can affect anyone, not just women, because all people have some breast tissue. Common symptoms include a lump or thickened area in the breast, nipple changes such as flattening or inversion, skin discoloration, changes in breast size or shape, dimpling or orange-peel texture, and flaking or crusting of the skin. These symptoms should be reported even if a recent mammogram was normal. Causes of breast cancer are not fully understood, but risk factors include family history, personal history of breast conditions, early menstruation, late menopause, dense breast tissue, alcohol use, obesity, radiation exposure, and inherited DNA changes such as BRCA1 and BRCA2. Prevention strategies include regular screening, breast self-awareness, limiting alcohol, exercising, maintaining a healthy weight, and discussing hormone therapy risks. For high-risk individuals, preventive medications or surgeries may be considered.","last_verified":"2025-10-31"}
{"id":"mayo-breast-cancer-care-teams-2025","source":"Mayo Clinic","title":"Breast Cancer – Doctors and Departments","url":"https://www.mayoclinic.org/diseases-conditions/breast-cancer/doctors-departments/ddc-20352478","text":"Mayo Clinic provides comprehensive breast cancer care through a multidisciplinary team across its campuses in Arizona, Florida, and Minnesota. Departments involved include surgical oncology, medical oncology, radiation oncology, plastic surgery, radiology, and women's health. Specialized programs such as the High Risk Breast Clinic, Cancer Survivorship Clinics, and the Proton Beam Therapy Program support personalized treatment. Patients have access to breast surgeons, oncologists, and palliative care specialists. Mayo Clinic also conducts research in breast cancer genetics, imaging, and treatment innovations, and offers clinical trial opportunities. The institution is recognized as a top cancer center and emphasizes collaborative, patient-centered care.","last_verified":"2025-10-31"}
{"id":"nhs-breast-cancer-treatment-2024","source":"NHS","title":"Treatment for Breast Cancer in Women","url":"https://www.nhs.uk/conditions/breast-cancer-in-women/treatment-for-breast-cancer-in-women","text":"Treatment for breast cancer depends on the cancer’s size, type, location, spread, and the patient’s overall health. The main treatment is usually surgery, which may involve removing the cancerous area (breast-conserving surgery), the entire breast (mastectomy), and sometimes lymph nodes. Breast reconstruction may follow. Additional treatments include radiotherapy to reduce recurrence risk, chemotherapy to shrink or control cancer, hormone therapy to block hormone-driven growth, and targeted or immunotherapy to help the immune system fight cancer. For secondary or advanced breast cancer, treatment focuses on symptom management and improving quality of life. Patients receive regular check-ups and are encouraged to report any concerns between appointments. A palliative care team may support those with incurable cancer.","last_verified":"2024-03-04"}
